program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3400.8.1"}, {"coremlc-version", "3400.7.1"}})]
{
    func main<ios16>(tensor<fp16, [?, 128, 1, 768]> hist_article_encoding, tensor<int32, [?, 128]> hist_channel_id) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, list<tensor<int32, [2]>, ?>>>>((("DefaultShapes", {{"hist_article_encoding", [1, 128, 1, 768]}, {"hist_channel_id", [1, 128]}}), ("RangeDims", {{"hist_article_encoding", [[1, -1], [128, 128], [1, 1], [768, 768]]}, {"hist_channel_id", [[1, -1], [128, 128]]}})))] {
            tensor<int32, [1]> model_1_tf_compat_v1_squeeze_Squeeze_axes_0 = const()[name = tensor<string, []>("model_1_tf_compat_v1_squeeze_Squeeze_axes_0"), val = tensor<int32, [1]>([-2])];
            tensor<fp16, [?, 128, 768]> model_1_tf_compat_v1_squeeze_Squeeze_cast = squeeze(axes = model_1_tf_compat_v1_squeeze_Squeeze_axes_0, x = hist_article_encoding);
            tensor<int32, []> model_1_embedding_1_embedding_lookup_axis_0 = const()[name = tensor<string, []>("model_1_embedding_1_embedding_lookup_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> model_1_embedding_1_embedding_lookup_batch_dims_0 = const()[name = tensor<string, []>("model_1_embedding_1_embedding_lookup_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [2308, 48]> model_1_embedding_1_embedding_lookup_5400_to_fp16 = const()[name = tensor<string, []>("model_1_embedding_1_embedding_lookup_5400_to_fp16"), val = tensor<fp16, [2308, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [?, 128, 48]> model_1_embedding_1_embedding_lookup_cast = gather(axis = model_1_embedding_1_embedding_lookup_axis_0, batch_dims = model_1_embedding_1_embedding_lookup_batch_dims_0, indices = hist_channel_id, x = model_1_embedding_1_embedding_lookup_5400_to_fp16);
            tensor<int32, [2]> model_1_dense_Tensordot_stackx = const()[name = tensor<string, []>("model_1_dense_Tensordot_stackx"), val = tensor<int32, [2]>([-1, 768])];
            tensor<fp16, [?, 768]> model_1_dense_Tensordot_Reshape_cast = reshape(shape = model_1_dense_Tensordot_stackx, x = model_1_tf_compat_v1_squeeze_Squeeze_cast);
            tensor<bool, []> model_1_dense_Tensordot_MatMul_transpose_x_0 = const()[name = tensor<string, []>("model_1_dense_Tensordot_MatMul_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> model_1_dense_Tensordot_MatMul_transpose_y_0 = const()[name = tensor<string, []>("model_1_dense_Tensordot_MatMul_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [768, 48]> model_1_dense_Tensordot_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_dense_Tensordot_ReadVariableOp_to_fp16"), val = tensor<fp16, [768, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(221696)))];
            tensor<fp16, [?, 48]> model_1_dense_Tensordot_MatMul_cast = matmul(transpose_x = model_1_dense_Tensordot_MatMul_transpose_x_0, transpose_y = model_1_dense_Tensordot_MatMul_transpose_y_0, x = model_1_dense_Tensordot_Reshape_cast, y = model_1_dense_Tensordot_ReadVariableOp_to_fp16);
            tensor<int32, [3]> model_1_dense_Tensordot_concat_1x = const()[name = tensor<string, []>("model_1_dense_Tensordot_concat_1x"), val = tensor<int32, [3]>([-1, 128, 48])];
            tensor<fp16, [?, 128, 48]> model_1_dense_Tensordot_cast = reshape(shape = model_1_dense_Tensordot_concat_1x, x = model_1_dense_Tensordot_MatMul_cast);
            tensor<fp16, [48]> model_1_dense_BiasAdd_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_dense_BiasAdd_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(295488)))];
            tensor<fp16, [?, 128, 48]> model_1_dense_BiasAdd_cast = add(x = model_1_dense_Tensordot_cast, y = model_1_dense_BiasAdd_ReadVariableOp_to_fp16);
            tensor<string, []> model_1_dense_Gelu_mul_1_mode_0 = const()[name = tensor<string, []>("model_1_dense_Gelu_mul_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [?, 128, 48]> model_1_dense_Gelu_mul_1_cast = gelu(mode = model_1_dense_Gelu_mul_1_mode_0, x = model_1_dense_BiasAdd_cast);
            tensor<int32, [2]> model_1_dense_1_Tensordot_stackx = const()[name = tensor<string, []>("model_1_dense_1_Tensordot_stackx"), val = tensor<int32, [2]>([-1, 48])];
            tensor<fp16, [?, 48]> model_1_dense_1_Tensordot_Reshape_cast = reshape(shape = model_1_dense_1_Tensordot_stackx, x = model_1_dense_Gelu_mul_1_cast);
            tensor<bool, []> model_1_dense_1_Tensordot_MatMul_transpose_x_0 = const()[name = tensor<string, []>("model_1_dense_1_Tensordot_MatMul_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> model_1_dense_1_Tensordot_MatMul_transpose_y_0 = const()[name = tensor<string, []>("model_1_dense_1_Tensordot_MatMul_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [48, 48]> model_1_dense_1_Tensordot_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_dense_1_Tensordot_ReadVariableOp_to_fp16"), val = tensor<fp16, [48, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(295680)))];
            tensor<fp16, [?, 48]> model_1_dense_1_Tensordot_MatMul_cast = matmul(transpose_x = model_1_dense_1_Tensordot_MatMul_transpose_x_0, transpose_y = model_1_dense_1_Tensordot_MatMul_transpose_y_0, x = model_1_dense_1_Tensordot_Reshape_cast, y = model_1_dense_1_Tensordot_ReadVariableOp_to_fp16);
            tensor<int32, [3]> model_1_dense_1_Tensordot_concat_1x = const()[name = tensor<string, []>("model_1_dense_1_Tensordot_concat_1x"), val = tensor<int32, [3]>([-1, 128, 48])];
            tensor<fp16, [?, 128, 48]> model_1_dense_1_Tensordot_cast = reshape(shape = model_1_dense_1_Tensordot_concat_1x, x = model_1_dense_1_Tensordot_MatMul_cast);
            tensor<fp16, [48]> model_1_dense_1_BiasAdd_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_dense_1_BiasAdd_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(300352)))];
            tensor<fp16, [?, 128, 48]> model_1_dense_1_BiasAdd_cast = add(x = model_1_dense_1_Tensordot_cast, y = model_1_dense_1_BiasAdd_ReadVariableOp_to_fp16);
            tensor<fp16, [?, 128, 48]> model_1_tf___operators___add_AddV2_cast = add(x = model_1_dense_1_BiasAdd_cast, y = model_1_embedding_1_embedding_lookup_cast);
            tensor<fp16, [128, 48]> model_1_p_emb_StatefulPartitionedCall_StatefulPartitionedCall_embedding_2_embedding_lookup_to_fp16 = const()[name = tensor<string, []>("model_1_p_emb_StatefulPartitionedCall_StatefulPartitionedCall_embedding_2_embedding_lookup_to_fp16"), val = tensor<fp16, [128, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(300544)))];
            tensor<fp16, [?, 128, 48]> model_1_p_emb_StatefulPartitionedCall_StatefulPartitionedCall_add_cast = add(x = model_1_p_emb_StatefulPartitionedCall_StatefulPartitionedCall_embedding_2_embedding_lookup_to_fp16, y = model_1_tf___operators___add_AddV2_cast);
            tensor<int32, [1]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_add_1_axes_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_add_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_mul_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_mul_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(312896)))];
            tensor<fp16, [48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(313088)))];
            tensor<fp16, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_add_y_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_add_y_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [?, 128, 48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_add_1_cast = layer_norm(axes = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_add_1_axes_0, beta = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_ReadVariableOp_to_fp16, epsilon = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_add_y_to_fp16, gamma = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_mul_ReadVariableOp_to_fp16, x = model_1_p_emb_StatefulPartitionedCall_StatefulPartitionedCall_add_cast);
            tensor<int32, [2]> concat_3x = const()[name = tensor<string, []>("concat_3x"), val = tensor<int32, [2]>([-1, 48])];
            tensor<fp16, [?, 48]> reshape_0_cast = reshape(shape = concat_3x, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_add_1_cast);
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [48, 48]> reshape_1_to_fp16 = const()[name = tensor<string, []>("reshape_1_to_fp16"), val = tensor<fp16, [48, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(313280)))];
            tensor<fp16, [?, 48]> matmul_0_cast = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = reshape_0_cast, y = reshape_1_to_fp16);
            tensor<int32, [4]> concat_7x = const()[name = tensor<string, []>("concat_7x"), val = tensor<int32, [4]>([-1, 128, 4, 12])];
            tensor<fp16, [?, 128, 4, 12]> reshape_2_cast = reshape(shape = concat_7x, x = matmul_0_cast);
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [48, 48]> reshape_4_to_fp16 = const()[name = tensor<string, []>("reshape_4_to_fp16"), val = tensor<fp16, [48, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(317952)))];
            tensor<fp16, [?, 48]> matmul_1_cast = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = reshape_0_cast, y = reshape_4_to_fp16);
            tensor<int32, [4]> concat_15x = const()[name = tensor<string, []>("concat_15x"), val = tensor<int32, [4]>([-1, 128, 4, 12])];
            tensor<fp16, [?, 128, 4, 12]> reshape_5_cast = reshape(shape = concat_15x, x = matmul_1_cast);
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [48, 48]> reshape_7_to_fp16 = const()[name = tensor<string, []>("reshape_7_to_fp16"), val = tensor<fp16, [48, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(322624)))];
            tensor<fp16, [?, 48]> matmul_2_cast = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = reshape_0_cast, y = reshape_7_to_fp16);
            tensor<int32, [4]> concat_23x = const()[name = tensor<string, []>("concat_23x"), val = tensor<int32, [4]>([-1, 128, 4, 12])];
            tensor<fp16, [?, 128, 4, 12]> reshape_8_cast = reshape(shape = concat_23x, x = matmul_2_cast);
            tensor<fp16, [4, 12]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_key_add_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_key_add_ReadVariableOp_to_fp16"), val = tensor<fp16, [4, 12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(327296)))];
            tensor<fp16, [?, 128, 4, 12]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_key_add_cast = add(x = reshape_2_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_key_add_ReadVariableOp_to_fp16);
            tensor<fp16, [4, 12]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_query_add_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_query_add_ReadVariableOp_to_fp16"), val = tensor<fp16, [4, 12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(327488)))];
            tensor<fp16, [?, 128, 4, 12]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_query_add_cast = add(x = reshape_5_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_query_add_ReadVariableOp_to_fp16);
            tensor<fp16, [4, 12]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_value_add_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_value_add_ReadVariableOp_to_fp16"), val = tensor<fp16, [4, 12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(327680)))];
            tensor<fp16, [?, 128, 4, 12]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_value_add_cast = add(x = reshape_8_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_value_add_ReadVariableOp_to_fp16);
            tensor<fp16, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_Mul_y_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_Mul_y_to_fp16"), val = tensor<fp16, []>(0x1.278p-2)];
            tensor<fp16, [?, 128, 4, 12]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_Mul_cast = mul(x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_query_add_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_Mul_y_to_fp16);
            tensor<bool, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_Einsum_transpose_x_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_Einsum_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_Einsum_transpose_y_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_Einsum_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<int32, [4]> transpose_26_perm_0 = const()[name = tensor<string, []>("transpose_26_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_27_perm_0 = const()[name = tensor<string, []>("transpose_27_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [?, 4, 128, 12]> transpose_36 = transpose(perm = transpose_27_perm_0, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_key_add_cast);
            tensor<fp16, [?, 4, 128, 12]> transpose_37 = transpose(perm = transpose_26_perm_0, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_Mul_cast);
            tensor<fp16, [?, 4, 128, 128]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_Einsum_cast = matmul(transpose_x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_Einsum_transpose_x_0, transpose_y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_Einsum_transpose_y_0, x = transpose_37, y = transpose_36);
            tensor<int32, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_softmax_Softmax_axis_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_softmax_Softmax_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [?, 4, 128, 128]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_softmax_Softmax_cast = softmax(axis = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_softmax_Softmax_axis_0, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_Einsum_cast);
            tensor<int32, [4]> transpose_8_perm_0 = const()[name = tensor<string, []>("transpose_8_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> matmul_3_transpose_x_0 = const()[name = tensor<string, []>("matmul_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_3_transpose_y_0 = const()[name = tensor<string, []>("matmul_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [?, 4, 128, 12]> transpose_35 = transpose(perm = transpose_8_perm_0, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_value_add_cast);
            tensor<fp16, [?, 4, 128, 12]> matmul_3_cast = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_softmax_Softmax_cast, y = transpose_35);
            tensor<int32, [4]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_1_Einsum_perm_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_1_Einsum_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [2]> concat_27x = const()[name = tensor<string, []>("concat_27x"), val = tensor<int32, [2]>([-1, 48])];
            tensor<fp16, [?, 128, 4, 12]> transpose_34 = transpose(perm = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_einsum_1_Einsum_perm_0, x = matmul_3_cast);
            tensor<fp16, [?, 48]> reshape_9_cast = reshape(shape = concat_27x, x = transpose_34);
            tensor<bool, []> matmul_4_transpose_x_0 = const()[name = tensor<string, []>("matmul_4_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_4_transpose_y_0 = const()[name = tensor<string, []>("matmul_4_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [48, 48]> reshape_10_to_fp16 = const()[name = tensor<string, []>("reshape_10_to_fp16"), val = tensor<fp16, [48, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(327872)))];
            tensor<fp16, [?, 48]> matmul_4_cast = matmul(transpose_x = matmul_4_transpose_x_0, transpose_y = matmul_4_transpose_y_0, x = reshape_9_cast, y = reshape_10_to_fp16);
            tensor<int32, [3]> concat_31x = const()[name = tensor<string, []>("concat_31x"), val = tensor<int32, [3]>([-1, 128, 48])];
            tensor<fp16, [?, 128, 48]> reshape_11_cast = reshape(shape = concat_31x, x = matmul_4_cast);
            tensor<fp16, [48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_attention_output_add_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_attention_output_add_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(332544)))];
            tensor<fp16, [?, 128, 48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_attention_output_add_cast = add(x = reshape_11_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_attention_output_add_ReadVariableOp_to_fp16);
            tensor<fp16, [?, 128, 48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_add_cast = add(x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_batchnorm_add_1_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_attention_output_add_cast);
            tensor<int32, [1]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_add_1_axes_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_add_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_mul_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_mul_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(332736)))];
            tensor<fp16, [48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(332928)))];
            tensor<fp16, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_add_y_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_add_y_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [?, 128, 48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_add_1_cast = layer_norm(axes = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_add_1_axes_0, beta = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_ReadVariableOp_to_fp16, epsilon = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_add_y_to_fp16, gamma = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_mul_ReadVariableOp_to_fp16, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_add_cast);
            tensor<int32, [2]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_stackx = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_stackx"), val = tensor<int32, [2]>([-1, 48])];
            tensor<fp16, [?, 48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_Reshape_cast = reshape(shape = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_stackx, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_add_1_cast);
            tensor<bool, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_MatMul_transpose_x_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_MatMul_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_MatMul_transpose_y_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_MatMul_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [48, 96]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_ReadVariableOp_to_fp16"), val = tensor<fp16, [48, 96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(333120)))];
            tensor<fp16, [?, 96]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_MatMul_cast = matmul(transpose_x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_MatMul_transpose_x_0, transpose_y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_MatMul_transpose_y_0, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_Reshape_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_ReadVariableOp_to_fp16);
            tensor<int32, [3]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_concat_1x = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_concat_1x"), val = tensor<int32, [3]>([-1, 128, 96])];
            tensor<fp16, [?, 128, 96]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_cast = reshape(shape = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_concat_1x, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_MatMul_cast);
            tensor<fp16, [96]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_BiasAdd_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_BiasAdd_ReadVariableOp_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(342400)))];
            tensor<fp16, [?, 128, 96]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_BiasAdd_cast = add(x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Tensordot_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_BiasAdd_ReadVariableOp_to_fp16);
            tensor<string, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Gelu_mul_1_mode_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Gelu_mul_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [?, 128, 96]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Gelu_mul_1_cast = gelu(mode = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Gelu_mul_1_mode_0, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_BiasAdd_cast);
            tensor<int32, [2]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_stackx = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_stackx"), val = tensor<int32, [2]>([-1, 96])];
            tensor<fp16, [?, 96]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_Reshape_cast = reshape(shape = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_stackx, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_2_Gelu_mul_1_cast);
            tensor<bool, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_MatMul_transpose_x_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_MatMul_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_MatMul_transpose_y_0 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_MatMul_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [96, 48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_ReadVariableOp_to_fp16"), val = tensor<fp16, [96, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(342656)))];
            tensor<fp16, [?, 48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_MatMul_cast = matmul(transpose_x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_MatMul_transpose_x_0, transpose_y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_MatMul_transpose_y_0, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_Reshape_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_ReadVariableOp_to_fp16);
            tensor<int32, [3]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_concat_1x = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_concat_1x"), val = tensor<int32, [3]>([-1, 128, 48])];
            tensor<fp16, [?, 128, 48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_cast = reshape(shape = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_concat_1x, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_MatMul_cast);
            tensor<fp16, [48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_BiasAdd_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_BiasAdd_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(351936)))];
            tensor<fp16, [?, 128, 48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_BiasAdd_cast = add(x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_Tensordot_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_BiasAdd_ReadVariableOp_to_fp16);
            tensor<fp16, [?, 128, 48]> model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_add_1_cast = add(x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_1_batchnorm_add_1_cast, y = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_sequential_dense_3_BiasAdd_cast);
            tensor<int32, [1]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_add_1_axes_0 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_add_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [48]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_mul_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_mul_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(352128)))];
            tensor<fp16, [48]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(352320)))];
            tensor<fp16, []> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_add_y_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_add_y_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [?, 128, 48]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_add_1_cast = layer_norm(axes = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_add_1_axes_0, beta = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_ReadVariableOp_to_fp16, epsilon = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_add_y_to_fp16, gamma = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_mul_ReadVariableOp_to_fp16, x = model_1_transformer_block_StatefulPartitionedCall_StatefulPartitionedCall_add_1_cast);
            tensor<int32, [2]> concat_35x = const()[name = tensor<string, []>("concat_35x"), val = tensor<int32, [2]>([-1, 48])];
            tensor<fp16, [?, 48]> reshape_12_cast = reshape(shape = concat_35x, x = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_add_1_cast);
            tensor<bool, []> matmul_5_transpose_x_0 = const()[name = tensor<string, []>("matmul_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_5_transpose_y_0 = const()[name = tensor<string, []>("matmul_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [48, 48]> reshape_13_to_fp16 = const()[name = tensor<string, []>("reshape_13_to_fp16"), val = tensor<fp16, [48, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(352512)))];
            tensor<fp16, [?, 48]> matmul_5_cast = matmul(transpose_x = matmul_5_transpose_x_0, transpose_y = matmul_5_transpose_y_0, x = reshape_12_cast, y = reshape_13_to_fp16);
            tensor<int32, [4]> concat_39x = const()[name = tensor<string, []>("concat_39x"), val = tensor<int32, [4]>([-1, 128, 4, 12])];
            tensor<fp16, [?, 128, 4, 12]> reshape_14_cast = reshape(shape = concat_39x, x = matmul_5_cast);
            tensor<bool, []> matmul_6_transpose_x_0 = const()[name = tensor<string, []>("matmul_6_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_6_transpose_y_0 = const()[name = tensor<string, []>("matmul_6_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [48, 48]> reshape_16_to_fp16 = const()[name = tensor<string, []>("reshape_16_to_fp16"), val = tensor<fp16, [48, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(357184)))];
            tensor<fp16, [?, 48]> matmul_6_cast = matmul(transpose_x = matmul_6_transpose_x_0, transpose_y = matmul_6_transpose_y_0, x = reshape_12_cast, y = reshape_16_to_fp16);
            tensor<int32, [4]> concat_47x = const()[name = tensor<string, []>("concat_47x"), val = tensor<int32, [4]>([-1, 128, 4, 12])];
            tensor<fp16, [?, 128, 4, 12]> reshape_17_cast = reshape(shape = concat_47x, x = matmul_6_cast);
            tensor<bool, []> matmul_7_transpose_x_0 = const()[name = tensor<string, []>("matmul_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_7_transpose_y_0 = const()[name = tensor<string, []>("matmul_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [48, 48]> reshape_19_to_fp16 = const()[name = tensor<string, []>("reshape_19_to_fp16"), val = tensor<fp16, [48, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(361856)))];
            tensor<fp16, [?, 48]> matmul_7_cast = matmul(transpose_x = matmul_7_transpose_x_0, transpose_y = matmul_7_transpose_y_0, x = reshape_12_cast, y = reshape_19_to_fp16);
            tensor<int32, [4]> concat_55x = const()[name = tensor<string, []>("concat_55x"), val = tensor<int32, [4]>([-1, 128, 4, 12])];
            tensor<fp16, [?, 128, 4, 12]> reshape_20_cast = reshape(shape = concat_55x, x = matmul_7_cast);
            tensor<fp16, [4, 12]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_key_add_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_key_add_ReadVariableOp_to_fp16"), val = tensor<fp16, [4, 12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(366528)))];
            tensor<fp16, [?, 128, 4, 12]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_key_add_cast = add(x = reshape_14_cast, y = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_key_add_ReadVariableOp_to_fp16);
            tensor<fp16, [4, 12]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_query_add_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_query_add_ReadVariableOp_to_fp16"), val = tensor<fp16, [4, 12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(366720)))];
            tensor<fp16, [?, 128, 4, 12]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_query_add_cast = add(x = reshape_17_cast, y = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_query_add_ReadVariableOp_to_fp16);
            tensor<fp16, [4, 12]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_value_add_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_value_add_ReadVariableOp_to_fp16"), val = tensor<fp16, [4, 12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(366912)))];
            tensor<fp16, [?, 128, 4, 12]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_value_add_cast = add(x = reshape_20_cast, y = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_value_add_ReadVariableOp_to_fp16);
            tensor<fp16, []> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_Mul_y_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_Mul_y_to_fp16"), val = tensor<fp16, []>(0x1.278p-2)];
            tensor<fp16, [?, 128, 4, 12]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_Mul_cast = mul(x = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_query_add_cast, y = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_Mul_y_to_fp16);
            tensor<bool, []> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_Einsum_transpose_x_0 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_Einsum_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_Einsum_transpose_y_0 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_Einsum_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<int32, [4]> transpose_28_perm_0 = const()[name = tensor<string, []>("transpose_28_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_29_perm_0 = const()[name = tensor<string, []>("transpose_29_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [?, 4, 128, 12]> transpose_32 = transpose(perm = transpose_29_perm_0, x = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_key_add_cast);
            tensor<fp16, [?, 4, 128, 12]> transpose_33 = transpose(perm = transpose_28_perm_0, x = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_Mul_cast);
            tensor<fp16, [?, 4, 128, 128]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_Einsum_cast = matmul(transpose_x = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_Einsum_transpose_x_0, transpose_y = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_Einsum_transpose_y_0, x = transpose_33, y = transpose_32);
            tensor<int32, []> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_softmax_Softmax_axis_0 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_softmax_Softmax_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [?, 4, 128, 128]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_softmax_Softmax_cast = softmax(axis = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_softmax_Softmax_axis_0, x = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_Einsum_cast);
            tensor<int32, [4]> transpose_19_perm_0 = const()[name = tensor<string, []>("transpose_19_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> matmul_8_transpose_x_0 = const()[name = tensor<string, []>("matmul_8_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_8_transpose_y_0 = const()[name = tensor<string, []>("matmul_8_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [?, 4, 128, 12]> transpose_31 = transpose(perm = transpose_19_perm_0, x = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_value_add_cast);
            tensor<fp16, [?, 4, 128, 12]> matmul_8_cast = matmul(transpose_x = matmul_8_transpose_x_0, transpose_y = matmul_8_transpose_y_0, x = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_softmax_Softmax_cast, y = transpose_31);
            tensor<int32, [4]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_1_Einsum_perm_0 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_1_Einsum_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [2]> concat_59x = const()[name = tensor<string, []>("concat_59x"), val = tensor<int32, [2]>([-1, 48])];
            tensor<fp16, [?, 128, 4, 12]> transpose_30 = transpose(perm = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_einsum_1_Einsum_perm_0, x = matmul_8_cast);
            tensor<fp16, [?, 48]> reshape_21_cast = reshape(shape = concat_59x, x = transpose_30);
            tensor<bool, []> matmul_9_transpose_x_0 = const()[name = tensor<string, []>("matmul_9_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_9_transpose_y_0 = const()[name = tensor<string, []>("matmul_9_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [48, 48]> reshape_22_to_fp16 = const()[name = tensor<string, []>("reshape_22_to_fp16"), val = tensor<fp16, [48, 48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(367104)))];
            tensor<fp16, [?, 48]> matmul_9_cast = matmul(transpose_x = matmul_9_transpose_x_0, transpose_y = matmul_9_transpose_y_0, x = reshape_21_cast, y = reshape_22_to_fp16);
            tensor<int32, [3]> concat_63x = const()[name = tensor<string, []>("concat_63x"), val = tensor<int32, [3]>([-1, 128, 48])];
            tensor<fp16, [?, 128, 48]> reshape_23_cast = reshape(shape = concat_63x, x = matmul_9_cast);
            tensor<fp16, [48]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_attention_output_add_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_attention_output_add_ReadVariableOp_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(371776)))];
            tensor<fp16, [?, 128, 48]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_attention_output_add_cast = add(x = reshape_23_cast, y = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_attention_output_add_ReadVariableOp_to_fp16);
            tensor<fp16, [?, 128, 48]> model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_add_cast = add(x = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_layer_normalization_2_batchnorm_add_1_cast, y = model_1_transformer_block_1_StatefulPartitionedCall_StatefulPartitionedCall_multi_head_attention_1_attention_output_add_cast);
